function sim = gaussianKernel(x1, x2, sigma)
%RBFKERNEL x1とx2との間の動径基底関数カーネルを返します。
%   sim = gaussianKernel(x1, x2)は、x1とx2の間のガウスカーネルと、
%   simの値を返します。

% x1とx2が列ベクトルであることを確認する
x1 = x1(:); x2 = x2(:);

% 次の変数を正しく返す必要があります。
sim = 0;

% ====================== ここにコードを実装する ======================
% 指示: バンド幅sigmaを持つガウスカーネルを使用して計算されたx1とx2の間の
%       類似性を返すように、この関数を実装します
%               
%
%


cWYtmNlp9tTKj6ltp7NvEN8npu3ScluYMfCNGPfr/ue2b01L1PRHFQ==



% =============================================================
    
end
