function [mu sigma2] = estimateGaussian(X)
% ESTIMATEGAUSSIAN この関数は、Xのデータを使用してガウス分布のパラメーターを
% 推定します。
%   [mu sigma2] = estimateGaussian(X) 
%   入力Xは、各行にn次元のデータ点を持つデータセットです。
%   出力は、データセットの平均であるn次元ベクトルmuと、n×1ベクトルである
%   分散sigma^2です。
% 

% 有用な変数
[m, n] = size(X);

% これらの値を正しく返す必要があります
mu = zeros(n, 1);
sigma2 = zeros(n, 1);

% ====================== ここにコードを実装する ======================
% 指示: データと分散の平均を計算してください。
%       特に、mu(i)はi番目のフィーチャーのデータの平均を含み、
%       sigma2(i)はi番目のフィーチャーの分散を含む必要があります。
%       
%




b3pghcQk9s3Uj9x1qvsQDp5os73NKlSRac/NGYD18aX2Lxs=





% =============================================================


end
