function [U, S] = pca(X)
% PCAは、データセットXで主成分分析を実行します。
%   [U, S] = pca(X)は、Xの共分散行列の固有ベクトルを計算します。
%   固有ベクトルをUに、固有値をS（の対角線上に）にセットして返します。
%

% 有用な値
[m, n] = size(X);

% 次の変数を正しく返す必要があります。
U = zeros(n);
S = zeros(n);

% ====================== ここにコードを実装する ======================
% 指示: まず、共分散行列を計算する必要があります。
%       次に、"svd"関数を使用して、共分散行列の固有ベクトルと固有値を
%       計算する必要があります。
%
% 注意: 共分散行列を計算するときは、m（サンプルの数）で割ることを
%       忘れないでください。
%


UWYn1YVprozigKR2rZg6Utdi5dakX0WRTIKfZ4X57LSsfkQC2a8JQ/5Kjw==




% =========================================================================

end
