function Z = projectData(X, U, K)
% PROJECTDATA 上位k個の固有ベクトルのみに射影したときの削減データ表現を計算します。
%
%   Z = projectData(X, U, K)は、Uの最初のK列に削減された次元空間への、 
%   正規化された入力Xの射影を計算します。
%   射影されたサンプルをZにセットして、返します。
%

% 次の変数を正しく返す必要があります。
Z = zeros(size(X, 1), K);

% ====================== ここにコードを実装する ======================
% 指示: Uの上位K個の固有ベクトルのみ（最初のK列）を使用して、データの
%       射影を計算します。
%       i番目のサンプルX(i,:)に対して、k番目の固有ベクトルへの射影は 
%       次のように与えられます。
%           x = X(i, :)';
%           projection_k = x' * U(:, k);
%

WC99mLxpuYzvj75wvPpRVMw=


% =============================================================

end
