function X_rec = recoverData(Z, U, K)
% RECOVERDATA 射影されたデータを使用して、元のデータの近似値を復元します。
%
%   X_rec = RECOVERDATA(Z, U, K)は、K次元に削減されたデータの元のデータの
%   近似値を復元します。X_recにおおよその再構築した結果をセットして返します。
%   
%

% 次の変数を正しく返す必要があります。
X_rec = zeros(size(Z, 1), size(U, 1));

% ====================== ここにコードを実装する ======================
% 指示: Uの上位K個の固有ベクトルを使用して元の空間に射影して、データの近似を
%       計算します。
%
%       i番目のサンプルZ(i,:)に対して、次元jの（近似）復元データは、
%       以下のように与えられます。
%           v = Z(i, :)';
%           recovered_j = v' * U(j, 1:K)';
%
%        U(j, 1:K)は、行ベクトルであることに注意してください。
%               

WlAy3YdprozgRATcp+BPVc0j/u3FQUCWJA==

% =============================================================

end
