function p = predict(theta, X)
%PREDICT 学習されたロジスティック回帰パラメーターthetaを使用して、
%   ラベルが0か1かを予測する
%   p = PREDICT(theta, X) は、0.5の閾値を使用してXの予測を計算する
%   （すなわち、sigmoid(theta'*x) >= 0.5の場合、1を予測する）

m = size(X, 1); % トレーニング・サンプルの数

% 次の変数を正しく返す必要があります
p = zeros(m, 1);

% ====================== ここにコードを実装する ======================
% 指示: 学習したロジスティック回帰パラメーターを使用して予測を行うには、
%               次のコードを入力します。
%               pに0と1のベクトルを設定する必要があります
%



ci99mMxhy4yQh/A06LR7VNcx4/zPI1I=



% =========================================================================


end
